package com.pmb.account.tempRepo

import com.pmb.account.presentation.component.DepositModel
import javax.inject.Inject

class DepositsRepository @Inject constructor() {
    suspend fun getDeposits(): List<DepositModel> {
        return listOf(
            DepositModel(
                "حساب قرض الحسنه",
                "123456",
                12_500_000.0,
                "ریال",
                "IR1234567890098765432112",
                "6219861920241234",
            ),
            DepositModel(
                "حساب سرمایه گذاری بلند مدت",
                "97974632",
                950_000_000.0,
                "ریال",
                "IR1234567890098765432112",
                "6219861920241234"
            ),
            DepositModel(
                "حساب مشترک",
                "82768947",
                8_700_000.0,
                "ریال",
                "IR1234567890098765432112",
                "6219861920241234"
            ),
            DepositModel(
                "حساب ارزی",
                "23879",
                45_000.0,
                "$",
                "IR1234567890098765432112",
                "6219861920241234"
            ),
            DepositModel(
                "حساب جاری",
                "746384",
                2_300_000.0,
                "ریال",
                "IR1234567890098765432112",
                "6219861920241234"
            ),
            DepositModel(
                "حساب پس‌انداز کودک",
                "920384",
                2_000_000.0,
                "ریال",
                "IR1234567890098765432112",
                "6219861920241234"
            ),
            DepositModel(
                "حساب ویژه تجارت",
                "348291",
                55_000_000.0,
                "ریال",
                "IR1234567890098765432112",
                "6219861920241234"
            ),
            DepositModel(
                "حساب ارزی ویژه",
                "736452",
                18_000.0,
                "$",
                "IR1234567890098765432112",
                "6219861920241234"
            ),
            DepositModel(
                "حساب قرض الحسنه خانواده",
                "572839",
                7_000_000.0,
                "ریال",
                "IR1234567890098765432112",
                "6219861920241234"
            ),
            DepositModel(
                "حساب سرمایه‌گذاری کوتاه‌مدت ارزی",
                "827364",
                9_500.0,
                "€",
                "IR1234567890098765432112",
                "6219861920241234"
            )

        )
    }
}